app/Controllers/AuthController.php

SELECT `users`.*, `accounts`.`password`, `accounts`.`is_verified`
FROM `users`
JOIN `accounts` ON `accounts`.`user_id` = `users`.`id`
WHERE `users`.`email` = 'gellimaegabuat@gmail.com'
 LIMIT 1
---
    public function loginAction()
    {
        $session  = session();
        $email    = trim($this->request->getPost('email'));
        $password = $this->request->getPost('password');

        if (!$email || !$password) {
            $session->setFlashdata('error', 'Please fill in all fields.');
            return redirect()->to('/login');
        }

        $userModel = new UserModel();

        $user = $userModel
            ->select('users.*, accounts.password, accounts.is_verified')
            ->join('accounts', 'accounts.user_id = users.id')
            ->where('users.email', $email)
            ->first();

INSERT INTO `login_logs` (`user_id`, `role`, `login_time`) VALUES ('21', 'user', '2026-03-18 08:23:19')
---
        ]);

        $loginLog = new LoginLog();
        $loginLog->insert([
            'user_id'    => $user['id'],
            'role'       => $user['role'],
            'login_time' => Time::now('Asia/Manila')->toDateTimeString(),
        ]);

SELECT *
FROM `login_logs`
WHERE `user_id` = '21'
AND `logout_time` IS NULL
ORDER BY `login_time` DESC
 LIMIT 1
UPDATE `login_logs` SET `logout_time` = '2026-03-18 08:23:36'
WHERE `login_logs`.`id` IN ('165')
---
    public function logout()
    {
        $session = session();
        $userId  = $session->get('user_id');

        if ($userId) {
            $loginLog  = new LoginLog();
            $latestLog = $loginLog
                ->where('user_id', $userId)
                ->where('logout_time', null)
                ->orderBy('login_time', 'DESC')
                ->first();

            if ($latestLog) {
                $loginLog->update($latestLog['id'], [
                    'logout_time' => Time::now('Asia/Manila')->toDateTimeString(),
                ]);