app/Controllers/BookController.php

SELECT `id`, `title`, `author`, `genre`, `preface`, `isbn`, `published_year`, `cover_image`, `total_copies`, `available_copies`, `status`
FROM `books`
WHERE `status` = 'active'
ORDER BY `title` ASC
SELECT `bb`.`id`, `bb`.`status`, `bb`.`borrowed_at`, `bb`.`due_date`, `bb`.`returned_at`, `bb`.`notes`, `b`.`title`, `b`.`author`
FROM `book_borrowings` `bb`
JOIN `books` `b` ON `b`.`id` = `bb`.`book_id`
WHERE `bb`.`user_id` = '21'
ORDER BY `bb`.`created_at` DESC
---
    public function index()
    {
        $userId = session()->get('user_id');

        $books = $this->db->table('books')
            ->select('id, title, author, genre, preface, isbn, published_year,
                      cover_image, total_copies, available_copies, status')
            ->where('status', 'active')
            ->orderBy('title', 'ASC')
            ->get()->getResultArray();

        $genres = array_values(array_unique(array_filter(array_column($books, 'genre'))));

        $myBorrowings = $this->db->table('book_borrowings bb')
            ->select('bb.id, bb.status, bb.borrowed_at, bb.due_date, bb.returned_at, bb.notes,
                      b.title, b.author')
            ->join('books b', 'b.id = bb.book_id')
            ->where('bb.user_id', $userId)
            ->orderBy('bb.created_at', 'DESC')
            ->get()->getResultArray();