app/Controllers/RagController.php

SELECT `id`, `title`, `author`, `genre`, `preface`, `published_year`, `total_copies`, `available_copies`
FROM `books`
WHERE `status` = 'active'
ORDER BY `title` ASC
 LIMIT 20
---
        // If keyword search found fewer than 3 results (vague/semantic query),
        // send the full catalog to Groq and let the LLM do the matching
        if (count($books) < 3) {
            $books = $db->table('books')
                ->select('id, title, author, genre, preface, published_year, total_copies, available_copies')
                ->where('status', 'active')
                ->orderBy('title', 'ASC')
                ->limit(20)
                ->get()->getResultArray();