app/Controllers/UserController.php

SELECT *
FROM `users`
WHERE `users`.`id` = '21'
SELECT `reservations`.*, `resources`.`name` as `resource_name`, `resources`.`description` as `resource_description`
FROM `reservations`
LEFT JOIN `resources` ON `resources`.`id` = `reservations`.`resource_id`
ORDER BY `reservations`.`reservation_date` DESC
---
    public function dashboard()
    {
        $session = session();
        $userId  = $session->get('user_id');

        if (!$userId) {
            return redirect()->to('/login');
        }

        // Get user data
        $userModel = new UserModel();
        $user      = $userModel->find($userId);

        // Get user's reservations
        $reservationModel = new ReservationModel();
        $reservations     = $reservationModel->getUserReservations($userId);

        // Get all reservations for calendar
        $allReservations = $reservationModel
            ->select('reservations.*, resources.name as resource_name, resources.description as resource_description')
            ->join('resources', 'resources.id = reservations.resource_id', 'left')
            ->orderBy('reservations.reservation_date', 'DESC')
            ->findAll();

SELECT *
FROM `books`
WHERE `status` = 'active'
ORDER BY `title` ASC
---

        // ── Books data for dashboard ──────────────────────
        $db       = \Config\Database::connect();
        $allBooks = $db->table('books')
            ->where('status', 'active')
            ->orderBy('title', 'ASC')
            ->get()->getResultArray();

SELECT `bb`.`id`, `bb`.`status`, `bb`.`borrowed_at`, `bb`.`due_date`, `bb`.`returned_at`, `b`.`title`, `b`.`author`
FROM `book_borrowings` `bb`
JOIN `books` `b` ON `b`.`id` = `bb`.`book_id`
WHERE `bb`.`user_id` = '21'
ORDER BY `bb`.`created_at` DESC
---
        );

        // Current user's borrowings (active + pending shown on dashboard)
        $myBorrowings = $db->table('book_borrowings bb')
            ->select('bb.id, bb.status, bb.borrowed_at, bb.due_date, bb.returned_at, b.title, b.author')
            ->join('books b', 'b.id = bb.book_id')
            ->where('bb.user_id', $userId)
            ->orderBy('bb.created_at', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `users`
WHERE `users`.`id` = '21'
SELECT *
FROM `resources`
ORDER BY `name` ASC
---
    public function reservation()
    {
        $session = session();
        $userId  = $session->get('user_id');

        if (!$userId) {
            return redirect()->to('/login');
        }

        $userModel = new UserModel();
        $user      = $userModel->find($userId);

        if (!$user) {
            $session->destroy();
            return redirect()->to('/login');
        }

        $resourceModel = new ResourceModel();
        $resources     = $resourceModel->orderBy('name', 'ASC')->findAll();

SELECT *
FROM `users`
WHERE `users`.`id` = '21'
---
    public function profile()
    {
        $session = session();
        $userId  = $session->get('user_id');

        if (!$userId) {
            return redirect()->to('/login');
        }

        $userModel        = new UserModel();
        $user             = $userModel->find($userId);