app/Models/ReservationModel.php

SELECT *
FROM `user_blocks`
WHERE `user_id` = '21'
AND `blocked_until` >= '2026-03-18'
---
    public function isBlocked($userId)
    {
        return $this->db->table('user_blocks')
            ->where('user_id', (int) $userId)
            ->where('blocked_until >=', date('Y-m-d'))
            ->get()
            ->getRowArray();

SELECT `r`.`id`, `r`.`e_ticket_code`, `r`.`reservation_date`, `r`.`start_time`, `r`.`end_time`, `r`.`purpose`, `r`.`status`, `r`.`claimed`, `r`.`claimed_at`, `r`.`pc_number`, `res`.`name` AS `resource_name`
FROM `reservations` `r`
JOIN `resources` `res` ON `res`.`id` = `r`.`resource_id`
WHERE `r`.`user_id` = '21'
ORDER BY `r`.`reservation_date` DESC
---
    public function getUserReservations($userId)
    {
        return $this->db->table('reservations r')
            ->select('
                r.id,
                r.e_ticket_code,
                r.reservation_date,
                r.start_time,
                r.end_time,
                r.purpose,
                r.status,
                r.claimed,
                r.claimed_at,
                r.pc_number,
                res.name AS resource_name
            ')
            ->join('resources res', 'res.id = r.resource_id')
            ->where('r.user_id', (int) $userId)
            ->orderBy('r.reservation_date', 'DESC')
            ->get()
            ->getResultArray();

SELECT *
FROM `user_blocks`
WHERE `user_id` = '21'
AND `blocked_until` >= '2026-03-18'
---
    public function checkFairness($userIdOrEmail): array
    {
        if (is_string($userIdOrEmail) && !is_numeric($userIdOrEmail)) {
            $userRow = $this->db->table('users')
                ->select('id')
                ->where('email', $userIdOrEmail)
                ->get()
                ->getRowArray();

            if (!$userRow) {
                return ['fair' => true, 'remaining' => 3];
            }
            $userId = (int) $userRow['id'];
        } else {
            $userId = (int) $userIdOrEmail;
        }

        if ($userId <= 0) {
            return ['fair' => true, 'remaining' => 3];
        }

        $twoWeeksAgo = date('Y-m-d', strtotime('-2 weeks'));

        $block = $this->db->table('user_blocks')
            ->where('user_id', $userId)
            ->where('blocked_until >=', date('Y-m-d'))
            ->get()
            ->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `reservations`
WHERE `user_id` = '21'
AND `created_at` >= '2026-03-04'
---
            ];
        }

        $recentReservations = $this->where('user_id', $userId)
            ->where('created_at >=', $twoWeeksAgo)
            ->countAllResults();